{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "74ec8642",
   "metadata": {},
   "source": [
    "#### A: Азбука\n",
    "Добро пожаловать в новый параграф! Теперь мы будем работать со строками — одним из ключевых типов коллекций в Python.\n",
    "Чтобы начать, разомнёмся на простой и доброй задаче из мира детского сада.\n",
    "\n",
    "Малыши начали учить алфавит. Воспитатель попросил их назвать слова, начинающиеся только с букв а, б или в.\n",
    "\n",
    "Напишите программу, которая проверит, что все введённые слова соответствуют этим правилам.\n",
    "\n",
    "Формат ввода\n",
    "Вводится натуральное число N — количество слов, названных детьми.\n",
    "В каждой из последующих N строк записано по одному слову строчными буквам.\n",
    "\n",
    "Формат вывода\n",
    "YES — если все слова начинаются с нужной буквы.\n",
    "NO — если хотя бы одно слово начинается не с нужной буквы."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "026fe247",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NO\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "\n",
    "flag = False\n",
    "for i in range(n):\n",
    "    word = input().strip()\n",
    "    if word[0] not in ('а', 'б', 'в'):\n",
    "        flag = True\n",
    "\n",
    "if not flag:\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43e0cefe",
   "metadata": {},
   "source": [
    "### B: Кручу-верчу\n",
    "Теперь, когда вы начали осваивать строки — пора немного поработать с их представлением.\n",
    "\n",
    "Иногда в текстовых редакторах возникает необходимость повернуть строку — то есть сделать из горизонтальной записи вертикальную.\n",
    "В Python такая функция по-умолчанию отсутствует, но это не проблема: мы напишем её сами!\n",
    "\n",
    "Напишите программу, которая преобразует введённую стоку из горизонтальной записи в вертикальную.\n",
    "\n",
    "Формат ввода\n",
    "Одна строка.\n",
    "\n",
    "Формат вывода\n",
    "Вертикальное представление введённой строки."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "a7b5fdee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "g\n",
      "f\n",
      "d\n",
      "s\n"
     ]
    }
   ],
   "source": [
    "s = input()\n",
    "print(*s[::-1], sep='\\n')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "812355ae",
   "metadata": {},
   "source": [
    "### C: Анонс новости\n",
    "Когда вы работаете со строками, часто приходится управлять их длиной — особенно в реальных проектах: сайтах, приложениях, чат-ботах.\n",
    "В этой задаче вы выступите в роли разработчика новостного сайта.\n",
    "\n",
    "Местная редакция заказала у вас систему для отображения заголовков. Чтобы лента была удобной, слишком длинные заголовки нужно сокращать и добавлять многоточие.\n",
    "\n",
    "Напишите программу, которая сокращает заголовки до требуемой длины.\n",
    "\n",
    "Если заголовок длиннее, он должен быть усечён и завершён многоточием ....\n",
    "Если заголовок помещается в заданную длину — выводите его без изменений.\n",
    "Формат ввода\n",
    "Вводится натуральное число L — необходимая длина заголовка.\n",
    "Вводится натуральное число N — количество заголовков, которые требуется сократить.\n",
    "В каждой из последующих N строк записано по одному заголовку.\n",
    "\n",
    "Формат вывода\n",
    "Сокращённые заголовки.\n",
    "\n",
    "Примечание\n",
    "Многоточие учитывается при подсчёте длины заголовка."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8f1fec7c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Начался саммит по глоб...\n",
      "Завтра Новый год!\n",
      "Python и Java конкурир...\n"
     ]
    }
   ],
   "source": [
    "l = int(input())\n",
    "n = int(input())\n",
    "\n",
    "for _ in range(n):\n",
    "    line = input().strip()\n",
    "    if len(line) > l:\n",
    "        print(line[:l - 3] + '...')\n",
    "    else:\n",
    "        print(line)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
