{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "74ec8642",
   "metadata": {},
   "source": [
    "#### A: Автоматизация списка\n",
    "Привет! Эти задачи направлены на отработку применения встроенных инструментов Python для генерации, комбинирования и обработки коллекций.\n",
    "\n",
    "Начнем с первой задачи. Не забывайте делать перерывы, если устали. Однако обязательно возвращайтесь к решению!\n",
    "\n",
    "В жизни часто приходится составлять списки: продуктов, задач на день, дел.\n",
    "Давайте автоматизируем это с помощью Python!\n",
    "\n",
    "Напишите программу, которая превращает строку слов в нумерованный список — по одному элементу на строку.\n",
    "\n",
    "Формат ввода\n",
    "Вводится одна строка.\n",
    "\n",
    "Формат вывода\n",
    "Требуется вывести нумерованный список, составленный из её слов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "026fe247",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1. Аня\n",
      "2. Боря\n",
      "3. Вова\n"
     ]
    }
   ],
   "source": [
    "a = input().split()\n",
    "for index, value in enumerate(a, 1):\n",
    "    print(f\"{index}. {value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43e0cefe",
   "metadata": {},
   "source": [
    "### B: Сборы на прогулку\n",
    "Воспитатель в детском саду устал тратить время, чтобы построить детей по парам. Он договорился с детьми, чтобы те делились на две, по возможности равные, группы.\n",
    "\n",
    "Напишите программу, которая по списку двух шеренг составляет пары детей.\n",
    "\n",
    "Формат ввода\n",
    "Вводится две строки с именами детей, записанными через запятую и пробел.\n",
    "\n",
    "Формат вывода\n",
    "Требуется вывести список пар, которые можно составить, если последовательно брать из каждой шеренги по одному ребёнку.\n",
    "Имена в парах выводить через дефис окружённый пробелами.\n",
    "\n",
    "Примечание\n",
    "В одной из групп может быть на одного ребенка больше, чем в другой.\n",
    "Этот ребёнок при формировании пар не учитывается и идёт в паре с воспитателем."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a7b5fdee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Боря - Аня\n",
      "Дима - Вова\n"
     ]
    }
   ],
   "source": [
    "a = input().split(', ')\n",
    "b = input().split(', ')\n",
    "\n",
    "for index, value in zip(a, b):\n",
    "    print(f\"{index} - {value}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "812355ae",
   "metadata": {},
   "source": [
    "### C: Рациональная считалочка\n",
    "Теперь потренируемся использовать бесконечные итераторы.\n",
    "Напишите программу, которая выводит последовательность чисел по заданным параметрам — началу, концу и шагу.\n",
    "\n",
    "Формат ввода\n",
    "В одну строку через пробел вводятся 3 рациональных числа — начало счета, конец и шаг.\n",
    "\n",
    "Формат вывода\n",
    "Последовательность чисел с заданными параметрами."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "8f1fec7c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3.20\n",
      "4.00\n",
      "4.80\n",
      "5.60\n",
      "6.40\n"
     ]
    }
   ],
   "source": [
    "from itertools import count\n",
    "start, stop, step = map(float, input().split())\n",
    "\n",
    "for num in count(start, step):\n",
    "    if num > stop:\n",
    "        break\n",
    "    print(f\"{num:.2f}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6dbb0b29",
   "metadata": {},
   "source": [
    "### D: Словарная ёлка\n",
    "Попробуем применить итератор к строкам, а не к числам.\n",
    "Напишите программу, которая превращает строку слов в «ёлку» — с каждой строкой список становится длиннее.\n",
    "\n",
    "Формат ввода\n",
    "В одну строку через пробел вводятся слова разделенные пробелом.\n",
    "\n",
    "Формат вывода\n",
    "Несколько строк. В каждой следующей строке на одно слово больше."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4be2151d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "мама\n",
      "мама мыла\n",
      "мама мыла раму\n"
     ]
    }
   ],
   "source": [
    "a = list(input().split())\n",
    "\n",
    "for i in range(1, len(a) + 1):\n",
    "    print(*a[0:i], sep=' ')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1141607",
   "metadata": {},
   "source": [
    "### E: Список покупок\n",
    "Поход в магазин часто вызывает проблемы. Если не подготовить список, можно уйти за хлебом, а вернуться с десятком пакетов.\n",
    "Напишите программу, которая собирает пожелания семьи (мамы, папы и дочки) в единый список и приводит его в порядок.\n",
    "\n",
    "Формат ввода\n",
    "В трёх строках записаны желаемые продукты (через запятую и пробел).\n",
    "\n",
    "Формат вывода\n",
    "Отсортированный по алфавиту список продуктов с нумерацией.\n",
    "\n",
    "Примечание\n",
    "Помните, что итераторы можно применять к другим итераторам."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "54e63de9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1. картина\n",
      "2. картонка\n",
      "3. корзина\n",
      "4. манка\n",
      "5. молоко\n",
      "6. мыло\n",
      "7. сыр\n",
      "8. хлеб\n"
     ]
    }
   ],
   "source": [
    "from itertools import chain\n",
    "\n",
    "a = input().split(', ')\n",
    "b = input().split(', ')\n",
    "c = input().split(', ')\n",
    "\n",
    "lst = sorted(list(chain(a, b, c)))\n",
    "\n",
    "for index, value in enumerate(lst, 1):\n",
    "    print(f\"{index}. {value}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
