{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "74ec8642",
   "metadata": {},
   "source": [
    "#### A: Математика — круто, но это не точно\n",
    "А вот и первая задача. Готовы?\n",
    "\n",
    "Давайте вспомним начало нашего задачника, когда всё было просто: мы не использовали ни циклы, ни коллекции, ни объектно-ориентированное программирование. Перед нами были только входные данные и требовалось предоставить результат.\n",
    "\n",
    "Напишите программу, которая вычисляет значение функции:\n",
    "\n",
    "f(x)=log_32(x^16/3) + x^cos(π⋅x/2⋅e)−sin^2(π/x)\n",
    "\n",
    "Формат ввода\n",
    "Вводится действительное число \n",
    "x\n",
    "\n",
    "Формат вывода\n",
    "Одно число — значение функции в заданной точке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "026fe247",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.4818035253577275\n"
     ]
    }
   ],
   "source": [
    "from math import log, cos, sin, pi, e\n",
    "\n",
    "x = float(input())\n",
    "\n",
    "a = log(x ** (3 / 16), 32)\n",
    "b = x ** (cos((pi * x) / (2 * e)))\n",
    "c = sin(x / pi) ** 2\n",
    "\n",
    "print(a + b - c)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43e0cefe",
   "metadata": {},
   "source": [
    "### B: Потоковый НОД\n",
    "Напишите программу, находящую наибольшие общие делители для всех переданных в стандартный поток последовательностей чисел.\n",
    "\n",
    "Формат ввода\n",
    "Вводятся строки чисел, разделённых пробелами.\n",
    "\n",
    "Формат вывода\n",
    "Последовательность чисел — наибольшие общие делители всех последовательностей."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "53426aa1",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "from math import gcd\n",
    "\n",
    "for row in sys.stdin:\n",
    "    res = gcd(*map(int, row.split()))\n",
    "    print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "812355ae",
   "metadata": {},
   "source": [
    "### C: Есть варианты?\n",
    "Вася пришёл на образовательный семинар и обнаружил, что зрителей на мероприятии — N, а количество мест — M.\n",
    "Помогите Васе определить вероятность того, что он попадёт на семинар.\n",
    "\n",
    "Формат ввода\n",
    "Два числа N и M.\n",
    "\n",
    "Формат вывода\n",
    "Два числа — количество вариантов, в которых Вася попадает на семинар и количество всех вариантов групп на семинаре"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "8f1fec7c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "36 120\n"
     ]
    }
   ],
   "source": [
    "from math import comb\n",
    "\n",
    "n, m = map(int, input().split())\n",
    "\n",
    "print(comb(n - 1, m - 1), comb(n, m))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6dbb0b29",
   "metadata": {},
   "source": [
    "### D: Среднее не арифметическое\n",
    "Средним геометрическим нескольких положительных вещественных чисел называют такое число, которым можно заменить каждое из этих чисел так, чтобы их произведение не изменилось.\n",
    "\n",
    "Формат ввода\n",
    "Вводится последовательность рациональных чисел, разделённых пробелами.\n",
    "\n",
    "Формат вывода\n",
    "Одно число — среднее геометрическое переданных чисел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4be2151d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.605171084697352\n"
     ]
    }
   ],
   "source": [
    "from math import prod\n",
    "\n",
    "x = list(map(float, input().split()))\n",
    "\n",
    "print(prod(x) ** (1 / len(x)))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1141607",
   "metadata": {},
   "source": [
    "### E: Шаг навстречу\n",
    "Два выдуманных человечка Дека и Поля, пользуются каждый своей системой координат. Деке нравится представлять себя в декартовом пространстве, а Поле — в полярном.\n",
    "\n",
    "Напишите программу, определяющую кротчайшее расстояние, которое нужно пройти Деке и Поле, чтобы встретиться.\n",
    "\n",
    "Формат ввода\n",
    "В первой строке записаны координаты Деки: два рациональных числа — x и y\n",
    "Во второй строке записаны координаты Поли: два рациональных числа — ρ и ϕ\n",
    "\n",
    "Формат вывода\n",
    "Одно число — расстояние между Декой и Полей.\n",
    "\n",
    "Примечание\n",
    "Дека и Поля живут на одной плоскости с общим центром.\n",
    "\n",
    "ϕ — измеряется в радианах."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "54e63de9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20.0\n"
     ]
    }
   ],
   "source": [
    "import math\n",
    "\n",
    "x_1, y_1 = map(float, input().split())\n",
    "x_2, y_2 = map(float, input().split())\n",
    "new_x_2 = x_2 * math.cos(y_2)\n",
    "new_y_2 = x_2 * math.sin(y_2)\n",
    "\n",
    "print(math.sqrt((x_1 - new_x_2) ** 2 + (y_1 - new_y_2) ** 2))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
